{
  "name": "Aarsh Chaurasia",
  "title": "Cybersecurity Practitioner | Security Contributor | Building, Okynus Tech",
  "tagline": "Passionate about building secure systems with real-world impact.",
  "about": {
    "education": "Cybersecurity-focused engineering student at National Forensic Sciences University, currently pursuing an integrated B.Tech-M.Tech in Computer Science with Cyber Security",
    "startup": "Founder of Okynus Tech — developing next-generation encryption and Digital Rights Management (DRM) solutions for secure content distribution. The startup is incubated under C3iHub (IIT Kanpur) and SSIP 2.0 (Government of Gujarat), and has won multiple innovation awards.",
   "experience": "Robust hands-on experience in cybersecurity, spanning industry, startups, and technical leadership. At we45, I’m working on core aspects of threat modeling — focusing on secure design, risk analysis, and research-driven security strategies. As the founder of Okynus Tech, I’m building next-generation encryption and DRM systems, backed by premier incubators like C3iHub (IIT Kanpur) and SSIP 2.0. At SecureDApp, I led vulnerability assessments, client-focused security audits, and the development of automated pentesting tools. Previously at Login2Xplore, I re-architected backend systems with enhanced access control, scalability, and data protection mechanisms.",
    "work": "Developed several real-world security tools and products: PhishSOC — an AI-powered phishing detection platform integrated with Splunk; a behavioral authentication engine using keystroke dynamics; a container vulnerability scanner with real-time alerting; and StudySync — an Android productivity app. Strong focus on threat detection, secure development, and scalable defense systems.",
    "research": "Currently researching mobile forensics techniques using AI and cloud computing. Working on behavioral authentication using keystroke dynamics. Exploring complex resource allocation in modern wireless networks with a focus on security implications.",
    "quote": "Cybersecurity isn't just about reacting — it's about building ahead of the threat."
  },
  "contact": {
    "email": "aarsh.chaurasia.201007@gmail.com",
    "linkedin": "https://www.linkedin.com/in/aarsh-chaurasia-03b46a270/",
    "github": "https://github.com/aarshx05",
    "instagram": "https://www.instagram.com/_.aarsh_/"
  }
}
